"""
Вариант 49.

Задание 1. Рассчитайте с помощью полиномов NASA теплоемкость и энтропию при 340 K для вещества по вариантам.
Рассчитать тепловой эффект и изменение энергии Гиббса при сгорании 1 моль в-ва при 340 K.

Вещество: C3H6O2 (EthylFormatT03/08C)

Вариант 24.
Задание 2. Выполните по вариантам задачу 2 ниже (рассчитать ТОЛЬКО изменение энтропии при смешении).

Газ: Kr.

"""
from math import log, pow


# 67.  C3H8O (1propanol)

# 49 C3H6O2 (EthylFormatT03/08C)


def H(R, T, data):
    return R * T * (data[0] + (data[1] / 2 * T) + (data[2] / 3 * T ** 2) + (data[3] / 4 * T ** 3) + (
            data[4] / 5 * T ** 4) + (data[5] / T))


def S(R, T, data):
    return R * (data[0] * log(T) + data[1] * T + (data[2] / 2) * T ** 2 + (data[3] / 3) * T ** 3 + (
            data[4] / 4) * T ** 4 + data[6])


def C(R, T, data):
    return R * (data[0] + data[1] * T + data[2] * T ** 2 + data[3] * T ** 3 + data[4] * T ** 4)




def main():
    R = 8.3144598
    T = 340

    data_C3H6O2 = [5.59040899E+00, 2.42724317E-03, 6.61618398E-05, -8.61263826E-08, 3.38174267E-11, -4.75699454E+04,
                    4.84087081E+00]

    data_O2 = [3.78245636E+00, -2.99673415E-03, 9.84730200E-06, -9.68129508E-09, 3.24372836E-12, -1.06394356E+03,
               3.65767573E+00]
    data_CO2 = [0.23568130E+01, 0.89841299E-02, -0.71220632E-05, 0.24573008E-08, -0.14288548E-12, -0.48371971E+05,
                0.99009035E+01]
    data_H2O = [7.25575005E+01, -6.62445402E-01, 2.56198746E-03, -4.36591923E-06, 2.78178981E-09, -4.18865499E+04,
                -2.88280137E+02]

    print(f'Теплоемкость - {C(R, T, data_C3H6O2)}', "Дж/моль * К")
    print(f'Энтропия - {S(R, T, data_C3H6O2)}', "Дж/моль * К\n")



    dH = (6 * H(R, T, data_CO2) + 6 * H(R, T, data_H2O) - 6 * H(R, T, data_O2) - 2 * H(R, T, data_C3H6O2)) / 2
    dS = (6 * S(R, T, data_CO2) + 6 * S(R, T, data_H2O) - 6 * S(R, T, data_O2) - 2 * S(R, T, data_C3H6O2)) / 2
    dG = dH - T * dS
    print("Формула сгорания - 2C3H6O2 + 6O2 = 6CO2 + 6H2O")
    print("Тепловой эффект сгорания = ", dH, "Дж/моль")
    print("Изменение энергии Гиббса = ", dG, "Дж/моль")

    # Task 2

    T = 308
    P = 40.53 * pow(10, 3)
    V1 = 2 * pow(10, -4)
    V2 = 7 * pow(10, -4)

    n1 = (P * V1) / (R * T)
    n2 = (P * V2) / (R * T)

    x1 = (n1) / (n1 + n2)
    x2 = (n2) / (n1 + n2)

    dS = -(n1 + n2) * R * (x1 * log(x1) + x2 * (log(x2)))

    print("dS = ", dS, "Дж/К")

    return 0

if __name__ == '__main__':
    main()